dic = ["後來", "事", "星", "方面", "裡", "的", "是", "一", "在","有","個","我","不","這","了","他","也","就","人","都","說","而","們","你","了","要","之","會","對","及","和","與","以","很","種","中","的","大","能","著","她","那","上","但","年","還","以","時","最","己","為","來","所","們","兩","各","上","可","為","或","好","等","又","將","後","為","於","由","從","更","被","才","已","者","每","次","把","三","麼","題","其","讓","此","做","再","以","只","與","有","則","灣","卻","地","並","位","得","想","去","呢","生","示","到","司","將","果","啊", "阿", "哎", "哎呀", "哎喲", "唉", "俺", "俺們", "按", "按照", "吧", "吧噠", "把", "罷了", "被", "本", "本著", "比", "比方", "比如", "鄙人", "彼", "彼此", "邊", "別", "別的", "別說", "並", "並且", "不比", "不成", "不單", "不但", "不獨", "不管", "不光", "不過", "不僅", "不拘", "不論", "不怕", "不然", "不如", "不特", "不惟", "不問", "不只", "朝", "朝著", "趁", "趁著", "乘", "沖", "除", "除此之外", "除非", "除了", "此", "此間", "此外", "從", "從而", "打", "待", "但", "但是", "當", "當著", "到", "得", "的", "的話", "等", "等等", "地", "第", "叮咚", "對", "對於", "多", "多少", "而", "而況", "而且", "而是", "而外", "而言", "而已", "爾後", "反過來", "反過來說", "反之", "非但", "非徒", "否則", "嘎", "嘎登", "該", "趕", "個", "各", "各個", "各位", "各種", "各自", "給", "根據", "跟", "故", "故此", "固然", "關於", "管", "歸", "果然", "果真", "過", "哈", "哈哈", "呵", "和", "何", "何處", "何況", "何時", "嘿", "哼", "哼唷", "呼哧", "乎", "嘩", "還是", "還有", "換句話說", "換言之", "或", "或是", "或者", "極了", "及", "及其", "及至", "即", "即便", "即或", "即令", "即若", "即使", "幾", "幾時", "己", "既", "既然", "既是", "繼而", "加之", "假如", "假若", "假使", "鑒於", "將", "較", "較之", "叫", "接著", "結果", "借", "緊接著", "進而", "盡", "儘管", "經", "經過", "就", "就是", "就是說", "據", "具體地說", "具體說來", "開始", "開外", "靠", "咳", "可", "可見", "可是", "可以", "況且", "啦", "來", "來著", "離", "例如", "哩", "連", "連同", "兩者", "了", "臨", "另", "另外", "另一方面", "論", "嘛", "嗎", "慢說", "漫說", "冒", "麼", "每", "每當", "們", "莫若", "某", "某個", "某些", "拿", "哪", "哪邊", "哪兒", "哪個", "哪裡", "哪年", "哪怕", "哪天", "哪些", "哪樣", "那", "那邊", "那兒", "那個", "那會兒", "那裡", "那麼", "那麼些", "那麼樣", "那時", "那些", "那樣", "乃", "乃至", "呢", "能", "你", "你們", "您", "甯", "寧可", "寧肯", "寧願", "哦", "嘔", "啪達", "旁人", "呸", "憑", "憑藉", "其", "其次", "其二", "其他", "其它", "其一", "其餘", "其中", "起", "起見", "起見", "豈但", "恰恰相反", "前後", "前者", "且", "然而", "然後", "然則", "讓", "人家", "任", "任何", "任憑", "如", "如此", "如果", "如何", "如其", "如若", "如上所述", "若", "若非", "若是", "啥", "上下", "尚且", "設若", "設使", "甚而", "甚麼", "甚至", "省得", "時候", "什麼", "什麼樣", "使得", "是", "是的", "首先", "誰", "誰知", "順", "順著", "似的", "雖", "雖然", "雖說", "雖則", "隨", "隨著", "所", "所以", "他", "他們", "他人", "它", "它們", "她", "她們", "倘", "倘或", "倘然", "倘若", "倘使", "騰", "替", "通過", "同", "同時", "哇", "萬一", "往", "望", "為", "為何", "為了", "為什麼", "為著", "喂", "嗡嗡", "我", "我們", "嗚", "嗚呼", "烏乎", "無論", "無甯", "毋寧", "嘻", "嚇", "相對而言", "像", "向", "向著", "噓", "呀", "焉", "沿", "沿著", "要", "要不", "要不然"]


aspect_hash = {}
opinion_hash = {}
File.open("../data/regexp5.txt", "rb").each do |l|
	temp = l.split(" ")
	aspect = temp[0]
	opinion = temp[1]

	if aspect_hash.has_key?(aspect)
		aspect_hash[aspect] = aspect_hash[aspect] + 1
	else
		aspect_hash[aspect] = 1
	end

	if opinion_hash.has_key?(opinion)
		opinion_hash[opinion] = opinion_hash[opinion] + 1
	else
		opinion_hash[opinion] = 1
	end

end

opinion_hash = opinion_hash.sort_by {|k, v| v}.reverse
aspect_hash = aspect_hash.sort_by {|k, v| v}.reverse

f1 = File.open("../data/aspect_sort.txt", "w")
f2 = File.open("../data/opinion_sort.txt", "w")

opinion_hash.each do |k, v|
	same  = false
	# p "k: #{k.encoding}"
	# 
	# puts k.encoding.force_encoding("UTF-8")
	# t.force_encoding("UTF-8")
	
	dic.each do |t|
		if k == t.force_encoding("ASCII-8BIT")

			same = true
			break
		end
	end
	if !same
		f2 << "#{k}\n"
	end
end

aspect_hash.each do |k, v|
	same = false
	# k = k.force_encoding("UTF-8")

	dic.each do |t|
		if k == t.force_encoding("ASCII-8BIT")
			same = true
			break
		end
	end
	if !same
		f1 << "#{k}\n"
	end
end 

f1.close
f2.close